Repository: roneno/scopa_ios
Catalog: Mobilicard/Modules/PaymentMethod/User Interface/*.lproj/PaymentMethod.strings
Languages: he

# 3AF-5P-39v.normalTitle
source: <Back
he: חזרה

# 807-V3-zb8.placeholder
source: First Name
he: שם פרטי

# EU1-5n-8ay.placeholder
source: Exp Date
he: תוקף הכרטיס MMYY

# gK2-1M-HNW.text
source: Valid payment method:
he: אמצעי תשלום בתוקף:

# jM5-f3-80x.text
source: Please enter card details:
he: אנא הזן את פרטי כרטיס האשראי:

# LSf-HR-QoM.placeholder
source: Last Name
he: שם משפחה

# mhg-mp-sIc.placeholder
source: Card Number
he: מספר כרטיס

# PCZ-JI-zhZ.text
source: Valid payment method:
he: אמצעי תשלום בתוקף:

# PQz-2f-twe.text
source: No valid payment method set
he: אין אמצעי תשלום בתוקף

# SMK-If-jW5.normalTitle
source: Add Payment Method
he: הוסף/עדכן אמצעי תשלום

# Tq1-re-6Bb.text
source: Card data is stored securely
he: נתוני הכרטיס נשמרים בצורה מאובטחת בהתאם לתקן PCI
